Repository: sigurdfdragon/Gui_Debug_Tools
Catalog: translations/*/LC_MESSAGES/wesnoth-Gui_Debug_Tools.po
Languages: es, uk

source: unit debug was used during turn of
es: se usó depuración de unidad durante el turno de
uk: відладку бійця було використану під час ходу

source: expert
es: experto
uk: експертний

source: female^expert
es: experta
uk: експертна

source: heroic
es: heroico
uk: героїчний

source: female^heroic
es: heroica
uk: героїчна

source: powerful
es: poderoso
uk: потужний

source: female^powerful
es: poderosa
uk: потужна

source: ethereal
es: etéreo
uk: безтілесний

source: female^ethereal
es: etérea
uk: безтілесна

source: 1 mp & 50% defense on all terrain
es: 1 pm y 50% defensa en todos los terrenos
uk: 1 очко руху та 50% захисту на усій місцевості

source: dummy_unit^GDT Dummy
es: Maniquí
uk: Манекен GDT

source: Gui Debug Tools
uk: Графічна відладка

source: Color
uk: Колір

source: ne
uk: nw

source: 'Default' indicates alignment set by unit type or outside of GDT. Any other box will set the alignment specified.
uk: 'Default' вказує на світогляд, встановлений типом бійця або поза цією графічною відладкою. Інші опції встановлять відповідний світогляд.

source: Variables
uk: Змінні

source: Alignment
uk: Світогляд

source: Misc
uk: Різне
