Repository: sigurdfdragon/Gui_Debug_Tools
Catalog: translations/*/LC_MESSAGES/wesnoth-Gui_Debug_Tools.po
Languages: es, uk

source: Provides debug tools in Wesnoth through a graphical user interface. The tools are available in the right-click menu when debug mode is active. Based on code from the Wesnoth Lua Pack.
es: Proporciona herramientas de depuración en Wesnoth a través de una interfaz gráfica de usuario. Las herramientas están disponibles en el menú contextual cuando el modo de depuración está activo. Basado en código de Wesnoth Lua Pack.
uk: Додає розширені інструменти відладки Wesnoth, використовуючи графічний інтерфейс користувача. Інструменти доступні через меню правою кнопкою миші, якщо цю модифікацію було активовано. Засновано на коді з Wesnoth Lua Pack.

source: Version:
es: Versión:
uk: Версія:

source: Author:
es: Autor:
uk: Автор:

source: Gamestate Inspector
es: Inspector de estado
uk: Інспектор стану гри

source: Lua Console
es: Consola de Lua
uk: Консоль Lua

source: Unit Debug
es: Depuración unidad
uk: Відладка бійця

source: Side Debug
es: Depuración bando
uk: Відладка сторони

source: OK
es: Aceptar
uk: Підтвердити

source: Cancel
es: Cancelar
uk: Скасувати

source: Side
es: Bando
uk: Сторона

source: The number of the side.
es: Número del bando.
uk: Номер сторони бійця.

source: Starting Location
es: Casilla de inicio
uk: Початкова позиція

source: The coordinates for the starting location of the side. 0,0 indicates no starting location.
es: Coordenadas de la casilla de inicio del bando. 0,0 indica que no hay casilla de inicio.
uk: Координати для початкової позиції сторони. 0,0 вказує на відсутність початкової позиції.

source: Current Player
es: Jugador actual
uk: Поточний гравець

source: The name of the entity controlling the side.
es: Nombre de la entidad que controla el bando.
uk: Ім'я того, хто контролює цю сторону.

source: Is Local
es: Es local
uk: Чи локальна

source: Indicates if the current instance of Wesnoth owns the side.
es: Indica si la instancia actual de Wesnoth posee el bando.
uk: Вказує, чи є ви власником цієї сторони.

source: Total Income
es: Ingreso total
uk: Прибуток сторони

source: The total of base + village income that the side receives each turn.
es: El total de ingresos base + aldea que el bando recibe en cada turno.
uk: Сума базового прибутку та прибутку з сіл, що сторона отримує кожного ходу.

source: Scroll to Leader
es: Desplazarse hasta el líder
uk: Показати лідера

source: Makes the view scroll to the side's leader at start of side turn.
es: Hace que la vista se desplace al líder del bando al comienzo del turno del bando.
uk: Змушує гру показувати лідера сторони на початку ходу сторони.

source: S.E.T.C.
es: S.C.F.T.

source: Prevents the side from being asked to confirm ending the turn, even if no action has been taken.
es: Evita que se pida al bando que confirme la finalización del turno, incluso si no se ha realizado ninguna acción.
uk: Прибирає попередження, що просить підтвердити кінець ходу, якщо сторона не вчинила жодної дії.

source: Fog
es: Niebla
uk: Туман

source: Activates fog for the side.
es: Activa niebla para el bando.
uk: Вмикає туман для сторони.

source: Shroud
es: Oscuridad
uk: Пелена

source: Activates shroud for the side.
es: Activa oscuridad para el bando.
uk: Вмикає пелену для сторони.

source: Hidden
es: Oculto
uk: Приховано

source: Prevents the side's details from being shown in the status table.
es: Evita que los detalles del bando se muestren en la tabla de estado.
uk: Прибирає інформацію про сторону з панелі статусу.

source: Seed Recall
es: Reincorporación
uk: Генерувати заклик

source: Clear
es: Limpiar
uk: Очистити

source: The recall list will be stocked with sets of recruits and their advancements, or the recall list can be cleared.
es: La lista de reincorporación se rellenará con conjuntos de reclutas y sus avances, o se puede borrar la lista de reincorporación.
uk: Список заклику буде наповнено бійцями та їхніми просуваннями, або його буде очищено.

source: Heal
es: Sanar
uk: Вилікувати

source: All the side's units on the map will be healed.
es: Todas las unidades del bando en el mapa serán sanadas.
uk: Всіх бійців сторони на мапі буде вилікувано.

source: Super Heal
es: Súper sanación
uk: Вилікувати++

source: All the side's units on the map will be super healed.
es: Todas las unidades del bando en el mapa serán súper sanadas.
uk: Всіх бійців сторони на мапі буде потужно вилікувано.

source: Teleport
es: Teletransportar
uk: Телепортувати

source: All on map units of the side will be placed at the coordinates specified. Single space places all non-leaders on the recall list.
es: Todas las unidades en el mapa del bando se colocarán en las coordenadas especificadas. Si es un solo espacio se coloca a todos los que no son líderes en la lista de recuperación.
uk: Всіх бійців сторони на мапі буде миттєво переміщено до вказаних координат. Єдиний пробіл поміщає всіх бійців, що не є лідерами, до списку заклику.

source: Goto
es: Ir a
uk: Йти до

source: All units of the side will move toward the coordinates specified. 0,0 and -999,-999 indicate no destination.
es: Todas las unidades del bando se moverán hacia las coordenadas especificadas. 0,0 y -999,-999 indican que no hay destino.
uk: Всі бійці сторони матимуть за мету рух до зазначених координат. 0,0 та -999,-999 вказують на відсутність мети.

source: Kill
es: Matar
uk: Вбити

source: All the side's units will be killed.
es: Todas las unidades del bando morirán.
uk: Всі бійці сторони будуть вбиті.

source: When the side is considered defeated.
es: Cuando el bando se considera derrotado.
uk: Коли сторона вважається переможеною.

source: no_leader_left
es: Sin líder

source: no_units_left
es: Sin unidades

source: never
es: Nunca

source: always
es: Siempre

source: The type of entity that enters moves for the side.
es: El tipo de entidad que realiza los movimientos del bando.
uk: Той, хто керує діями сторони.

source: human
es: Humano
uk: людина

source: ai
es: IA
uk: комп'ютер

source: null
es: Nulo
uk: ніхто

source: Gold
es: Oro
uk: Золото

source: The amount of gold the side has.
es: Cantidad de oro que tiene el bando.
uk: Кількість золота сторони.

source: Village Gold
es: Oro por aldea
uk: Прибуток з села

source: Each village controlled by the side will yield this amount of income.
es: Cada aldea controlada por el bando produce esta cantidad de ingresos.
uk: Кожне село, що контролюється стороною, зможе приносити цю кількість прибутку.

source: Village Support
es: Mantenimiento por aldea
uk: Утримання з села

source: Each village controlled by the side will support this number of unit levels.
es: Cada aldea controlada por el bando mantendrá este número de niveles de unidades.
uk: Кожне село, що контролюється стороною, зможе утримувати вказану кількість рівнів бійців.

source: Base Income
es: Ingresos base
uk: Базовий прибуток

source: The amount of income the side receives per turn.
es: Cantidad de ingresos que el bando recibe por turno.
uk: Прибуток, який сторона отримує кожного ходу.

source: Recall Cost
es: Reincorporación
uk: Ціна заклику

source: The amount of gold needed to recall units of this side.
es: Cantidad de oro necesaria para reincorporar unidades de este bando.
uk: Кількість золота, що необхідна цій стороні для заклику бійців.

source: The color that is applied to the side's flag and units.
es: Color que se aplica a la bandera y unidades del bando.
uk: Колір, яким опозначені бійці та прапори сторони.

source: Flag
es: Bandera
uk: Прапор

source: The flag that flies over villages that the side controls.
es: La bandera que ondea sobre los pueblos que controla el bando.
uk: Прапор, що майорить над селами, що контролює сторона.

source: Flag Icon
es: Icono de bandera
uk: Вигляд прапору

source: The flag icon that is displayed next to the turn counter for the side.
es: El icono de la bandera que se muestra junto al contador de turnos del bando.
uk: Зображення прапору сторони, що відображається поряд з лічильником ходів.

source: User Team Name
es: Nombre del equipo
uk: Назва команди

source: The player visible team name for the side in the status table.
es: Nombre visible del equipo del jugador para el bando en la tabla de estado.
uk: Назва команди сторони, що вказується в панелі статусу.

source: Team Name
es: ID de equipo
uk: ID команди

source: The player team name for the side used internally by the game.
es: Nombre del equipo del jugador para el bando utilizado internamente por el juego.
uk: Назва команди сторони, що використовується грою.

source: Recruit
es: Reclutar
uk: Вербування

source: The unit types that any leader of the side can recruit.
es: Tipos de unidad que cualquier líder del bando puede reclutar.
uk: Типи бійців, яких може вербувати будь-який лідер цієї сторони.

source: Recall Units
es: Reincorporar unidades
uk: Бійці заклику

source: The units with the specified IDs will be recalled.
es: Las unidades con la ID especificada serán reincorporadas.
uk: Бійців з вказаними ID буде закликано.

source: Controller
es: Controlador
uk: Керування

source: Defeat Condition
es: Condición de derrota
uk: Поразка

source: Allows changes to various aspects of a side.
es: Permitir cambios en varios aspectos del bando.
uk: Дозволяє змінювати різноманітни параметри сторони.

source: Set the desired parameters, then press OK to confirm or Cancel to exit
es: Establece los parámetros deseados y pulsa Aceptar para confirmar, o Cancelar para salir sin aplicar los cambios
uk: Встановіть бажані параметри, після чого натисність "Підтвердити" або "Скасувати", щоб вийти

source: The flag of the side.
es: Bandera del bando.
uk: Прапор сторони.

source: side debug was used during turn of
es: Se utilizó depuración de bando durante el turno de
uk: відладку сторони було використано під час ходу

source: Error, return value :
es: Error, valor de retorno :
uk: Помилка, повернено значення :

source: Name
es: Nombre
uk: Ім'я

source: The player visible name of the unit.
es: Nombre visible al jugador de la unidad.
uk: Ім'я бійця, що відображується для гравця.

source: The internal WML designation for the unit. Each unit ID needs to be unique.
es: La designación WML interna para la unidad. Cada ID de unidad debe ser única.
uk: Внутрішнє ім'я бійця, що розпізнається WML. Кожне ID бійця має бути унікальним.

source: Underlying ID
es: ID subyacente
uk: Внутрішнє ID

source: The internal C++ designation for the unit.
es: La designación interna en C++ para la unidad.
uk: Внутрішнє ім'я бійця, що розпізнається C++.

source: Level
es: Nivel
uk: Рівень

source: The unit will be advanced or declined to the specified level.
es: La unidad avanzará o retrocederá hasta el nivel especificado.
uk: Бійця буде просунуто або повернено до вказаного рівня.

source: Type
es: Tipo
uk: Тип

source: What kind of unit this is.
es: El tipo de unidad que es.
uk: До якого типу належить цей боєць.

source: Variation
es: Variación
uk: Різновид

source: The variation of the unit type that this unit is.
es: Variación del tipo de unidad que es.
uk: Різновид типу бійця, до якого належить цей боєць.

source: Location
es: Ubicación
uk: Позиція

source: The coordinates on the map where the unit is located. Empty string places the unit on the recall list.
es: Las coordenadas del mapa donde se encuentra la unidad. Un valor vacío colocará la unidad en la lista de reincorporación.
uk: Координати клітинки, на якій знаходиться боєць. Якщо задати пусте значення, боєць потрапить до списку заклику.

source: The unit will move toward the coordinates specified. 0,0 and -999,-999 indicate no destination.
es: La unidad se moverá hacia las coordenadas especificadas. 0,0 y -999,-999 indican que no hay destino.
uk: Боєць матиме за мету рух до зазначених координат. 0,0 та -999,-999 вказують на відсутність мети.

source: Upkeep
es: Mantenimiento
uk: Утримання

source: The unit will have the upkeep specified.
es: La unidad tendrá el mantenimiento especificado.
uk: Боєць матиме зазначену ціну утримування.

source: Can Recruit
es: Puede reclutar
uk: Може вербувати

source: Makes the unit a leader and able to recruit.
es: Hacer esta unidad líder y permitirle reclutar.
uk: Робить бійця лідером та надає здатність вербувати.

source: Unrenamable
es: No renombrable
uk: Незмінне ім'я

source: Prevents changing the unit's name in the right click menu.
es: Previene cambiar el nombre de la unidad con el menú en clic derecho.
uk: Забороняє змінювати ім'я бійця, використовуючи меню правої кнопки миші.

source: Generate Name
es: Generar nombre
uk: Генерувати ім'я

source: If the unit type has random names available, a new name will be generated.
es: Si el tipo de unidad tiene nombres aleatorios disponibles, se generará un nuevo nombre.
uk: Якщо тип бійця має список випадкових імен, буде згенероване нове ім'я.

source: The unit will be healed with moves restored, regardless of other settings in this dialog.
es: La unidad se curará con sus movimientos restaurados, independientemente de otras configuraciones en este cuadro de diálogo.
uk: Бійця буде вилікувано з відновленими очками руху, незалежно від інших налаштувань в цьому вікні.

source: The unit will be super healed with extra hitpoints, moves, and attacks left.
es: La unidad será súper curada y tendrá puntos de vida, movimientos y ataques extra.
uk: Бійця буде потужно вилікувано з додатковими очками здоров'я, руху та атак.

source: Copy
es: Copiar
uk: Копіювати

source: Copies of the unit will be created. Will be identical except for id and name.
es: Se crearán copias de la unidad. Serán idénticas a excepción de la ID y el nombre.
uk: Буде створено копії бійця, що будуть ідентичними, за винятком id та імені.

source: Poisoned
es: Envenenado

source: The unit loses HP each turn.
es: La unidad perderá PV cada turno.
uk: Боєць втрачає ЗД кожного ходу.

source: Slowed
es: Ralentizado

source: The unit has 50% of its normal movement and does half damage.
es: La unidad tendrá el 50% de su movimiento normal y hará la mitad de daño.
uk: Боєць має 50% від свого руху та завдає лише половину шкоди.

source: Petrified
es: Petrificado

source: The unit cannot move, attack, or be attacked.
es: La unidad no podrá moverse, atacar, o ser atacada.
uk: Боєць не може рухатися, атакувати чи бути атакованим.

source: Attacks can't hit the unit.
es: Los ataques no podrán acertar a la unidad.
uk: Атаки не можуть вразити бійця.

source: Uncovered
es: Descubierto

source: The unit has performed an action (e.g. attacking) that causes it to no longer be hidden until the next turn.
es: La unidad ha realizado una acción (por ejemplo, atacar) que hace que ya no esté oculta hasta el próximo turno.
uk: Боєць виконав дію(наприклад, атаку), яка викриває його до наступного ходу.

source: Guardian
es: Guardián

source: The unit will not move, except to attack something in immediate range.
es: La unidad no se moverá, excepto para atacar algo en el rango inmediato.
uk: Боєць не рухатиметься, якщо не бачитиме цілі в своєму полі зору.

source: Unhealable
es: No sanable

source: The unit cannot be healed.
es: La unidad no podrá ser sanada.
uk: Бійця неможливо вилікувати.

source: Stunned
es: Aturdido

source: The unit has lost its zone of control until next turn. This status is only available in some campaigns and add-ons.
es: La unidad ha perdido su zona de control hasta el próximo turno. Este estado solo está disponible en algunas campañas y complementos.
uk: Боєць втрачає свою зону контролю до наступного ходу. Цей статус доступний лише в деяких кампаніях та аддонах.

source: Not Living
es: No muerto

source: If checked, the unit will gain undrainable, unplagueable, and unpoisonable. If those three are checked, the unit will gain not_living
es: Si se marca, la unidad ganará no drenable, no plagable y no envenenable. Si estos tres están marcados, la unidad obtendrá no muerto.
uk: Якщо обрано, боєць отримає статуси undrainable, unplagueable та unpoisonable. Якщо ж, натомість, обрано вищезгадані три статуси, боєць отримає статус not_living

source: Undrainable
es: No drenable

source: The unit will not give life to another unit if the drain special is used against it.
es: La unidad no dará vida a otra unidad si el drenaje especial se usa en su contra.
uk: Боєць не віддасть своїх життєвих сил іншому бійцю, якщо той матиме атаку з висмоктуванням.

source: Unplagueable
es: No plagable

source: The unit is immune to the plague special.
es: La unidad será inmune al especial de plaga.
uk: Боєць має імунітет до чуми.

source: Unpoisonable
es: No envenenable

source: The unit cannot be poisoned.
es: La unidad no podrá ser envenenada.
uk: Бійця неможливо отруїти.

source: Unslowable
es: No ralentizable

source: The unit cannot be slowed.
es: La unidad no podrá ser ralentizada.
uk: Бійця неможливо сповільнити.

source: Unpetrifiable
es: No petrificable

source: The unit cannot be petrified.
es: La unidad no podrá ser petrificada.
uk: Бійця неможливо скам'янити.

source: Which way the unit is looking.
es: En qué dirección mira la unidad.
uk: Сторона, в яку дивиться боєць.

source: nw
es: no

source: sw
es: so

source: Resting
es: Descansando
uk: Відпочиває

source: If the unit is resting, it will receive rest healing at the start of its next turn.
es: Si la unidad está descansando, recibirá sanación por descanso al comienzo de su siguiente turno.
uk: Якщо боєць відпочиває, він отримає лікування відпочинком на початку свого наступного ходу.

source: If the unit has been hidden using [hide_unit]. This is not the same as a [hides] ability.
es: Si la unidad se ha ocultado usando [hide_unit]. Esto no es lo mismo que una habilidad [hides].
uk: Якщо юніта було прихованого за допомогою [hide_unit]. Це не те ж саме, що збідність [hides].

source: The gender of the unit. Note that changing gender will cause any custom profile portraits to be lost.
es: El género de la unidad. Ten en cuenta que cambiar el género hará que se pierdan los retratos de perfil personalizados.
uk: Стать бійця. Зауважте, що зміна статі призведе до втрати будь-яких користувацьких портретів.

source: Male
es: Masculino
uk: Ч

source: Female
es: Femenino
uk: Ж

source: The side the unit belongs to.
es: Bando al que pertenece la unidad.
uk: Сторона, до якої належить боєць.

source: Hitpoints
es: Puntos de vida
uk: Здоров'я

source: The amount of hitpoints the unit has.
es: Cantidad de puntos de vida que tiene la unidad.
uk: Кількість очків здоров'я, яку має боєць.

source: Experience
es: Experiencia
uk: Досвід

source: The amount of experience the unit has. If somehow above max_experience, it will be set to max - 1.
es: La cantidad de experiencia que tiene la unidad. Si se supera el máximo de experiencia, se establecerá en máximo - 1.
uk: Кількість очків досвіду, яку має боєць. Якщо значення більше max_experience, воно буде встановлено на 1 менше від максимуму.

source: Moves
es: Movimientos
uk: Очки руху

source: The amount of move points the unit has.
es: Cantidad de puntos de movimiento que tiene la unidad.
uk: Кількість очків руху, що має боєць.

source: Attacks Left
es: Ataques restantes
uk: Лишилось атак

source: The number of attacks the unit can make on the current turn.
es: Número de ataques que la unidad puede realizar en el turno actual.
uk: Кількість атак, які може зробити боєць протягом поточного ходу.

source: Advancements
es: Promociones
uk: Просування

source: The number of amlas the unit has. If the unit is at its highest level, this value may be adjusted, though setting to 0 will always clear.
es: El número de AMLAS que tiene la unidad. Si la unidad está en su nivel más alto, este valor se puede ajustar, aunque ajustar a 0 siempre se borrará.
uk: Кількість AMLA, що має боєць. Якщо боєць досяг найвищого рівня, це значення може бути змінено, проте встановлення його на 0 здійснює очищення.

source: The amount of gold needed to recall this unit. -1 indicates the side default amount.
es: La cantidad de oro necesaria para reincorporar esta unidad. -1 indica la cantidad predeterminada del bando.
uk: Кількість золота, що необхідна, щоб закликати цього бійця. -1 встановлює типове для сторони бійця значення.

source: Extra Recruit
es: Reclutamientos
uk: Вербування+

source: Unit types the unit can recruit in addition to the ones its side can recruit, if the unit is a leader.
es: Tipos de unidad que la unidad puede reclutar además de los que su bando puede reclutar, si la unidad es líder.
uk: Типи бійців, яких може вербувати боєць на додачу до тих, яких може вербувати сторона, якщо боєць є лідером.

source: Advances To
es: Promociona a
uk: Просувається до

source: The unit types that the unit can advance to upon leveling.
es: Los tipos de unidad a los que la unidad puede avanzar al subir de nivel.
uk: Типи бійців, у які може просунутися боєць після підвищення рівня.

source: Role
es: Rol
uk: Роль

source: An additional field that can be used to identify a unit.
es: Un campo adicional que se puede utilizar para identificar una unidad.
uk: Додаткове поле, що може використовуватися для розпізнавання бійця.

source: Attack
es: Atacar
uk: Атака

source: The unit will receive the attack indicated. Use form 'Unit Type,Attack Index'. Single space clears added attacks.
es: La unidad recibirá el ataque indicado. Utiliza la forma 'Tipo de unidad, Índice de ataque'. Un solo espacio borra los ataques añadidos.
uk: Боєць отримає зазначену атаку. Використуйте формат 'Unit Type,Attack Index'. Пробіл очищає додані атаки.

source: Abilities
es: Habilidades
uk: Здібності

source: The unit will receive the abilities of the unit types entered. Single space clears added abilities.
es: La unidad recibirá todas las habilidades del tipo de unidad especificado. Un solo espacio borra las habilidades añadidas.
uk: Боєць отримає здібності зазначених типів бійців. Пробіл очищає додані здібності.

source: Objects
es: Objetos
uk: Об'єкти

source: Copy: 'Unit Id,Index' - Remove all copies of an object: 'remove,Index' Omit index to copy or remove all objects.
es: Copiar: 'ID de unidad, Índice' - Elimina todas las copias de un objeto: 'remove,Índice'. Omitir índice para copiar o eliminar todos los objetos.
uk: Копіювати: 'Unit Id,Index' — видаляє всі копії об'єкта: 'remove,Index'. Опустіть індекс, щоб скопіювати або видалити всі об'єкти.

source: Traits
es: Rasgos
uk: Риси

source: The unit will be altered by the traits listed. Valid traits are all in mainline, all race traits, any trait currently existing, and any the unit could receive or currently has.
es: La unidad tendrá los rasgos listados. Los rasgos válidos son todos los de la línea principal, los rasgos de raza, cualquier rasgo existente y cualquiera que la unidad pueda recibir o ya tenga.
uk: Бійця буде змінено відповідно до зазначених рис. Приймаються лише ті риси, що були включені в базову гру.

source: Overlays
es: Superposiciones
uk: Накладення

source: The unit's image will be altered by overlays listed here.
es: La imagen de la unidad se verá con las superposiciones listadas aquí.
uk: На зображення бійця буде накладено зазначені зображення.

source: Unit variables and sub-containers can be set/changed using the form 'var=value'
es: Las variables de unidad y sus subcontenedores se pueden configurar/cambiar usando la forma 'var=valor'
uk: Змінні бійця та контейнери можуть бути встановлені чи змінені, використовуючи формат 'var=value'

source: Gender
es: Género
uk: Стать

source: Status
es: Estado
uk: Статус

source: Facing
es: Orientación
uk: Дивиться на

source: Allows changes to various aspects of a unit.
es: Permitir cambios a varias características de una unidad.
uk: Дозволяє змінювати різноманітні параметри бійця.

source: The image of the unit.
es: La imagen de la unidad.
uk: Зображення бійця.

source: Profile
es: Perfil
uk: Довідка бійця

source: Displays the help entry for the unit.
es: Mostrar la entrada de ayuda de la unidad
uk: Відображає сторінку довідки для цього бійця.
